Autodesk.Revit.DB.Element.ChangeTypeId(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Changes the type of all elements in the given set.
Remarks:
In some cases, applying a change in type will result in a new element being created.
The only active examples of this are when applying a normal wall type to a curtain panel, or
converting such a wall back to a curtain panel.
Then return map would have (original element id, new element id) pair(s).
Note: this function needs an open transaction.
Note: this function calls regeneration.
document:
The document.
elementIds:
A collection of element IDs.
typeId:
Identifier of the type to assign to this element.
Returns:
The map of original element IDs to the new element IDs
if some elements were replaced by new elements
(the map is empty if no elements were replaced)
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one of the elements in elementIds does not exist in the document
-or-
Not all elements elementIds can have a type assigned.
-or-
The type typeId is not valid for at least one of the elements in elementIds.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
One or more elements in elementIds is a member of a loaded family.
-or-
One or more elements in elementIds is a member of a group type that is
not being edited.
Since:
2011

Autodesk.Revit.DB.Element.GetValidTypes(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Obtains a set of types that are valid for all given elements.
document:
The document.
elementIds:
A collection of element IDs.
Returns:
A set of element IDs of types that are valid for these elements or an empty set if any element cannot have a type assigned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when at least one of the elements does not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Element.IsValidType(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Checks if given type is valid for the set of elements.
Remarks:
A type is valid for the set of elements if it is valid for each and every element in the set.
document:
The document.
elementIds:
A collection of element IDs.
typeId:
ElementId of the type to check.
Returns:
True if all elements can have a type assigned and this type is valid for all elements, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when at least one of the elements does not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Element.CanHaveTypeAssigned(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Checks if all elements in the set can have a type assigned.
document:
The document.
elementIds:
A collection of element IDs.
Returns:
True if all elements in the set can have a type assigned, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when at least one of the elements does not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Element.BoundingBox(Autodesk.Revit.DB.View)
Retrieves a box that circumscribes all geometry of the element.
Remarks: Pass in a view to query view-specific (e.g., cut) geometry or null for model
geometry. If view box is not known, will return model box; if model box is not known,
will return null. Also note that this bounding box value
may include geometry that is not obvious. For example, the "flip controls" that
could be part of a family will be included in the computation of the bounding box even
though they are not always visible in the family instance of the family.

Autodesk.Revit.DB.Element.Geometry(Autodesk.Revit.DB.Options)
Retrieves the geometric representation of the element.
options: User preferences for parsing of geometry.
Remarks:
This call will retrieve 3d representation of the element. null will be returned
for symbols, annotations or details. This involves extensive parsing or Revit's data
structures, so try to minimize calls if performance is critical.
Geometry objects provided from this method are obtained directly from the element. When
the element is changed for any reason, the geometry will be recalculated by Revit and geometry
objects obtained before the change are likely to no longer be valid.  If you need to preserve
geometry information obtained an element even after changes to that element, you should copy
the geometry objects or save the properties independently.
If you require that the geometry items obtained contain valid
Reference objects, be sure to set the CalculateReferences
property of the options.
An element that provides access to the geometry of the element.

Autodesk.Revit.DB.Element.Parameter(System.String)
Retrieves a parameter from the element given its name.
paramName: The name of the parameter to be retrieved.